{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "loaded language",
    "1": "false dichotomy",
    "2": "manufactured consensus",
    "3": "cherry-picking",
    "4": "whataboutism"
  },
  "initializer_range": 0.02,
  "label2id": {
    "cherry-picking": 3,
    "false dichotomy": 1,
    "loaded language": 0,
    "manufactured consensus": 2,
    "whataboutism": 4
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.57.6",
  "vocab_size": 30522
}
